#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/fe17d314-2451-4b66-ad64-120ea98535b9/resourceGroups/eastus2-fourlanches-rg]
azurerm_service_plan.main_app_service: Refreshing state... [id=/subscriptions/fe17d314-2451-4b66-ad64-120ea98535b9/resourceGroups/eastus2-fourlanches-rg/providers/Microsoft.Web/serverfarms/eastus2-fourlanches-app-service]
module.dbs.azurerm_postgresql_flexible_server.main_psqlserver: Refreshing state... [id=/subscriptions/fe17d314-2451-4b66-ad64-120ea98535b9/resourceGroups/eastus2-fourlanches-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/eastus2-fourlanches-psqlserver]
module.dbs.azurerm_mysql_flexible_server.main_mysql_db: Refreshing state... [id=/subscriptions/fe17d314-2451-4b66-ad64-120ea98535b9/resourceGroups/eastus2-fourlanches-rg/providers/Microsoft.DBforMySQL/flexibleServers/eastus2-fourlanches-mysqlserver]
module.dbs.azurerm_cosmosdb_account.main_cosmos_account: Refreshing state... [id=/subscriptions/fe17d314-2451-4b66-ad64-120ea98535b9/resourceGroups/eastus2-fourlanches-rg/providers/Microsoft.DocumentDB/databaseAccounts/fourlanches-cosmosdb-account]
azurerm_storage_account.main_sa: Refreshing state... [id=/subscriptions/fe17d314-2451-4b66-ad64-120ea98535b9/resourceGroups/eastus2-fourlanches-rg/providers/Microsoft.Storage/storageAccounts/eastus2fourlanchessa]
module.k8s.azurerm_kubernetes_cluster.k8s: Refreshing state... [id=/subscriptions/fe17d314-2451-4b66-ad64-120ea98535b9/resourceGroups/eastus2-fourlanches-rg/providers/Microsoft.ContainerService/managedClusters/fourlanchesk8s]
module.dbs.azurerm_postgresql_flexible_server_database.main_db: Refreshing state... [id=/subscriptions/fe17d314-2451-4b66-ad64-120ea98535b9/resourceGroups/eastus2-fourlanches-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/eastus2-fourlanches-psqlserver/databases/fourlanches-db]
module.dbs.azurerm_mysql_flexible_database.main_mysql_db: Refreshing state... [id=/subscriptions/fe17d314-2451-4b66-ad64-120ea98535b9/resourceGroups/eastus2-fourlanches-rg/providers/Microsoft.DBforMySQL/flexibleServers/eastus2-fourlanches-mysqlserver/databases/fourlanches-db]
module.dbs.azurerm_cosmosdb_mongo_database.payment_app_cosmos_database: Refreshing state... [id=/subscriptions/fe17d314-2451-4b66-ad64-120ea98535b9/resourceGroups/eastus2-fourlanches-rg/providers/Microsoft.DocumentDB/databaseAccounts/fourlanches-cosmosdb-account/mongodbDatabases/payment-db]
module.dbs.azurerm_cosmosdb_mongo_collection.payments_cosmos_collection: Refreshing state... [id=/subscriptions/fe17d314-2451-4b66-ad64-120ea98535b9/resourceGroups/eastus2-fourlanches-rg/providers/Microsoft.DocumentDB/databaseAccounts/fourlanches-cosmosdb-account/mongodbDatabases/payment-db/collections/payments]
module.functions.azurerm_linux_function_app.auth_function: Refreshing state... [id=/subscriptions/fe17d314-2451-4b66-ad64-120ea98535b9/resourceGroups/eastus2-fourlanches-rg/providers/Microsoft.Web/sites/eastus2-fourlanches-auth-function]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.dbs.azurerm_mysql_flexible_server.main_mysql_db must be replaced
-/+ resource "azurerm_mysql_flexible_server" "main_mysql_db" {
      ~ fqdn                          = "eastus2-fourlanches-mysqlserver.mysql.database.azure.com" -> (known after apply)
      ~ id                            = "/subscriptions/fe17d314-2451-4b66-ad64-120ea98535b9/resourceGroups/eastus2-fourlanches-rg/providers/Microsoft.DBforMySQL/flexibleServers/eastus2-fourlanches-mysqlserver" -> (known after apply)
        name                          = "eastus2-fourlanches-mysqlserver"
      ~ public_network_access_enabled = true -> (known after apply)
      ~ replica_capacity              = 10 -> (known after apply)
      ~ replication_role              = "None" -> (known after apply)
      - tags                          = {} -> null
      ~ version                       = "5.7" -> "8.0.21" # forces replacement
        # (8 unchanged attributes hidden)

      - storage {
          - auto_grow_enabled  = true -> null
          - io_scaling_enabled = false -> null
          - iops               = 360 -> null
          - size_gb            = 20 -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @felipemag, Action: `pull_request`*